In [6]:
import numpy as np
import pandas as pd

In [8]:
d ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [10]:
df = pd.DataFrame(d)

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [16]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [18]:
df.fillna(value='Fill value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill value  2
2  Fill value  Fill value  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64